# написать программу котрая считывает три числа и выдает их сумму
def sum():
    a = int(input('Введи число а = '))
    b = int(input('Введи второе число b = '))
    c = int(input('Введи третье число с = '))
    res = a + b + c
    print(f'(сумма  a,b,c) = {res}')
    

sum()
     

    
