# Напишите программу, которая приветствует пользователя, выводя слово Hello, введенное имя и знаки препинания по образцу:

# name = input('Введите Ваше имя: ')
# print(f'Hello, {name}!')



n = input()
n = n + '!'
print('Hello,', n)