# написать программу которая принимает стороны двух катетов и выдает площадь прямоугольного треугольника

a = int(input('Введите строну первого катета: '))
b = int(input('введите сторону второго катета: '))

s = 0.5 * b * a
print(f'Площадь теругольника равна {s}')