# Напишите программу, которая считывает целое число и выводит текст, аналогичный приведенному в примере (пробелы важны!).

number = int(input('введите целое число: '))

print(f'The next number for the number {number} is {number+1}.\nThe previous number for the number {number} is {number-1}.')


# x = int(input())
# y = x + 1
# z = x - 1
# print('The next number for the number ', x, 'is ', y, end='.')
# print('\nThe previous number for the number ',x ,'is ', z, end='.')