# Дано натуральное число. Выведите его последнюю цифру.
num = int(input('enter natural number: '))
result = num % 10
print(result)